# -*- coding: utf-8 -*-

rating_list={
" Любой":"",
"от 1":"1",
"от 2":"2",
"от 3":"3",
"от 4":"4",
"от 5":"5",
"от 6":"6",
"от 7":"7",
"от 8":"8",
"от 9":"9"
}

type_list={
" Фильм":"movies",
"Сериал":"serials"
}

quality_list={
" Любое":"",
"Высокое":"hq",
"Хорошее":"hd",
"Низкое":"low"
}

country_list={
" Все":"",
"США":"сша",
"франция":"франция",
"великобритания":"великобритания",
"СССР":"ссср",
"Россия":"россия",
"япония":"япония",
"италия":"италия",
"индия":"индия",
"канада":"канада",
"германия":"германия",
"испания":"испания",
"гонконг":"гонконг",
"корея южная":"корея%20южная",
"австралия":"австралия",
"швеция":"швеция",
"германия (фрг)":"германия%20(фрг)",
"бельгия":"бельгия",
"польша":"польша",
"нидерланды":"нидерланды",
"дания":"дания",
"китай":"китай",
"украина":"украина",
"бразилия":"бразилия",
"мексика":"мексика",
"норвегия":"норвегия",
"аргентина":"аргентина",
"швейцария":"швейцария",
"турция":"турция",
"тайвань":"тайвань",
"австрия":"австрия",
}

year_list={
" Любой":"",
"2017":"2017%2C2017",
"2016":"2016%2C2016",
"2015":"2015%2C2015",
"2014":"2014%2C2014",
"2013":"2013%2C2013",
"2012":"2012%2C2012",
"2011":"2011%2C2011",
"2010":"2010%2C2010",
"2000-е":"2000%2C2009",
"90-е":"1990%2C1999",
"80-е":"1980%2C1989",
"70-е":"1970%2C1979",
"60-е":"1960%2C1969",
"50-е":"1950%2C1959",
"40-е":"1940%2C1949",
"30-e":"1910%2C1939"
}


sort_list={
"по дате выхода":"date",
"по рейтингу":"rating",
"по популярности":"popularity"
}


genre_list={
" Все":"",
"драма":"драма",
"комедия":"комедия",
"мелодрама":"мелодрама",
"триллер":"триллер",
"боевик":"боевик",
"криминал":"криминал",
"мультфильм":"мультфильм",
"ужасы":"ужасы",
"приключения":"приключения",
"короткометражка":"короткометражка",
"документальный":"документальный",
"семейный":"семейный",
"детектив":"детектив",
"фантастика":"фантастика",
"фэнтези":"фэнтези",
"тв шоу":"тв шоу",
"военный":"военный",
"история":"история",
"биография":"биография",
"музыка":"музыка",
"мюзикл":"мюзикл",
"аниме":"аниме",
"вестерн":"вестерн",
"спорт":"спорт",
"детский":"детский",
"реальное тв":"реальное%20ТВ",
"фильм-нуар":"фильм-нуар",
"концерт":"концерт",
"новости":"новости",
"ток-шоу":"ток-шоу",
"игра":"игра"
 }